ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
/***
 * 題名：LCD表示制御アプリ
 * 作成者：浅尾　享一
 * LCD/VFD表示の制御を行うアプリケーション
***/
#include "tmpm380_DCONT.h"

const uint8_t NUMDEG[]  = "0123456789";
const uint8_t NUMDEG2[] = " 123456789";

/* セルフテスト用NV-RAMチェック時 */
const uint8_t NVRMITB[] = {
    0x01, 0xAA,/* パスワード */
    0x00,/* SYSFLG */
    0x00,/* ABNF */
    0x0A,/* パターン1設定温度 */
    0x0A,/* パターン2設定温度 */
    0x0A,/* パターン3設定温度 */
    0x0A,/* パターン4設定温度 */
    0x00,/* 冷却パターン */
    20,/* 常温槽設定水温20℃ */
    0x00,/* 異常履歴と異常件数 */
    0x00,/* 異常履歴 */
    0x00,/* 異常履歴 */
    0x00,/* 冷却開始時刻（分） */
    0x00,/* 冷却開始時刻（時） */
    0x00,/* 冷却終了時刻（分） */
    0x00,/* 冷却終了時刻（時） */
    0x00,/* 積算稼働時間（分） */
    0x00,/* 積算稼働時間（時）下位 */
    0x00,/* 積算稼働時間（時）上位 */
    0x00,/* チラー予約時間（分） */
    0x08,/* チラー予約時間（時） */
    0x00,/* 冷却工程時間（秒） */
    0x00,/* 冷却工程時間（分） */
    0x00,/* 冷却工程番号 */
    0x05,/* パターン1徐冷時間 */
    0x05,/* パターン2徐冷時間 */
    0x05,/* パターン3徐冷時間 */
    0x05,/* パターン4徐冷時間 */
    0x00,/* 現在のパターン選択値 */
    0x00/*  運転待機時間（分） */
};

void DCONT(void)
{
    OS_TSKCon1 *OS_LoadTime;/* OS設定値を読むためのポインタ構造体に名前をつける */
    OS_LoadTime = OSTSKCon1S();/* 関数経由でポインタをOSparamにアクセス */
    
    uint8_t  REG_00, REG_01 = 0;/* 一時変数セット */
    uint32_t REG_02 = 0;
    
    for (uint8_t i = 0;i < 2;i++) {
        /* わざと繰り返し構文を設置する（continue;で戻る様にする為） */
        i = 1;/* 次回、必ずループから抜けられるように値をセット */
        
        switch (DLWSQ) {
        case 0:
            /* 初回である場合 */
            DLWSQ = 1;/* 次回スタート位置を1にする */
            OS_LoadTime->NEXT_LOAD_Time[5] = 100;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 1:
            /* 2回目である場合 */
            TSB_PA->DATA &= 0x1F;/* LCD,VFDのE/RW/RSをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x03;/* LCDデータバス出力をセット、初期化（4ビットバス設定）コマンド */
            
            EPLS();/* Eをパルス出力する */
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 5;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 2:
        case 3:
            /* 3,4回目である場合 */
            EPLS();/* Eをパルス出力する */
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 4:
            /* 5回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x02;/* LCDデータバス出力をセット、2行コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 5:
            /* 6回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x02;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x08;/* LCDデータバス出力をセット、2行コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 6:
            /* 7回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA |= 0x08;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 7:
            /* 8回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
