ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA |= 0x01;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 8:
            /* 9回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA |= 0x06;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 9:
            /* 10回目である場合 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 次回スタート位置をインクリメント */
            
            TSB_PA_DATA_PA6 = 0;/* RWをオフする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA |= 0x0C;/* LCDデータバス出力をセット、？コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
            OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
            return;/* 戻る */
            break;
            
        case 10:
            /* 11回目である場合 */
            if ((STSFL0 & 0x02) == 0) {
                /* 初期化完了していない場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            if ((STSFL1 & 0x02) > 0) {
                /* メモリークリアフラグがオンしている場合 */
                if (MCLAST >= 60) {
                    /* メモリークリア受付完了である場合 */
                    MCLRMS();/* 飛びます */
                    DLWSQ = 29;/* LCD表示制御を「29」選択 */
                    
                    i = 0;/* 繰り返しの変数を一旦クリア */
                    continue;/* ループの先頭へ */
                    
                } else {
                    /* メモリークリア受付未完了である場合 */
                    OS_LoadTime->NEXT_LOAD_Time[5] = 1;/* 次回呼び出し時間 */
                    OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
                    
                    return;/* 戻る */
                    
                }
                
            }/* メモリークリアフラグがオンしていない場合はここに抜ける */
            
            if (TNO > 0) {
                /* セルフテストモードである場合 */
                DLWSQ = 19;/* LCD表示制御を「19」選択、ｾﾙﾌﾃｽﾄの処理へ */
                i = 0;/* 繰り返しの変数を一旦クリア */
                continue;/* ループの先頭へ */
                
            }
            
            if (((SYSFLG & 0x40) > 0) && ((RPAT & 0x20) == 0) && ((STSFL0 & 0x20) == 0)) {
                /* 電源ONで、洗浄工程中ではなく、準備中である場合 */
                MXOTN6 |= 0x20;/* 準備LEDをオンする */
                MX6BLK |= 0x20;/* 準備LEDの点滅をセット */
                
            } else {
                /* 電源OFFか、洗浄工程中であるか、準備中でない場合 */
                MXOTN6 &= 0xDF;/* 準備LEDをオフする */
                MX6BLK &= 0xDF;/* 準備LEDの点滅をクリア */
                
            }
            
            if ((SYSFLG & 0x40) > 0) {
                /* 電源オンである場合 */
                MXOTN6 |= 0x10;/* 電源LEDをセットする */
                
            } else {
                /* 電源オフである場合 */
                MXOTN6 &= 0xEF;/* 電源LEDをクリアする */
                
            }
            
            if ((SYKND0 & 0x10) > 0) {
                /* 蒸気式である場合 */
                SYSFLG &= 0xDF;/* チラー予約フラグを強制オフにする */
                
            }
            
            if ((SYSFLG & 0x20) > 0) {
                /* チラー予約されている場合 */
                MXOTN6 |= 0x80;/* チラー予約LEDをオン */
                
            } else {
                /* チラー予約されていない場合 */
                MXOTN6 &= 0x7F;/* チラー予約LEDをクリアする */
                
            }
            
            if ((SYSFLG & 0x02) == 0) {
                /* 運転がオフである場合 */
                MXOTN6 &= 0xBF;/* 運転LEDをオフ */
                MX6BLK &= 0xBF;/* 点滅フラグをオフ */
                
            } else {
                /* 運転がオンである場合 */
                MXOTN6 |= 0x40;/* 運転LEDをオン */
                if (CCSEQ >= 10) {
                    /* 真空解除工程である場合 */
                    MX6BLK |= 0x40;/* 点滅フラグをオン */
                    
