ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
            }
            
            if (((RPAT & 0x20) > 0)
            || ((RPAT & 0x20) == 0) && ((SYSFLG & 0x40) == 0) && ((STSFL0 & 0x80) == 0)) {
                /* 洗浄工程中か、洗浄工程中ではなく電源がオフで、設定ﾓｰﾄﾞではない場合 */
                MXOTN6 &= 0xF0;/* パターンLEDをクリア */
                
            } else {
                /* 洗浄工程中ではないとき、電源オンか、設定モードのとき */
                MXOTN6 &= 0xF0;/* マスク */
                if (NPAT == 0) {
                    /* パターンが1の場合 */
                    MXOTN6 |= 0x01;/* 1セット */
                    
                } else if (NPAT == 1) {
                    /* パターンが2の場合 */
                    MXOTN6 |= 0x02;/* 2セット */
                    
                } else if (NPAT == 2) {
                    /* パターンが3の場合 */
                    MXOTN6 |= 0x04;/* 3セット */
                    
                } else {
                    /* パターンが4の場合 */
                    MXOTN6 |= 0x08;/* 4セット */
                    
                }
                
            }
            
            if ((SYSFLG & 0x40) == 0) {
                /* 電源オフである場合 */
                ABNFO = 0;/* 旧異常フラグをリセット */
                
                if ((STSFL0 & 0x80) == 0) {
                    /* 設定中ではない場合 */
                    DSPNO = 0;/* 時計表示をセット */
                    
                } else if ((DSPSEQ != 4) || ((DSPSEQ == 4) && (DSPSSQ == 0))) {
                    /* 洗浄モードでない、又は洗浄モードであり、メインメニューである場合 */
                    if ((DSPNO != 7) && (DSPSEQ > 0)) {
                        /* 設定画面へ変更時であり、画面シーケンスが進んでいた場合 */
                        DSPSEQ = 0;/* 一度クリア */
                        
                    }
                    DSPNO = 7;/* 設定モード表示セット */
                    
                } else {
                    /* これ以外の場合 */
                    DSPNO = 5;/* 洗浄モード表示をセット */
                    
                }
                
            } else {
                /* 電源オンである場合 */
                if ((ABNF & 0x0F) > 0) {
                    /* 異常がセットされている場合 */
                    STSFL0 &= 0x7F;/* 設定モードフラグを強制リセット */
                    STSFL0 |= 0x20;/* 準備中フラグをリセット */
                    
                    if ((ABNF & 0x0F) != ABNFO) {
                        /* 異常が変化していた場合 */
                        DSPSEQ = 0;/* 画面シーケンスをクリアする */
                        
                        /* 異常履歴の更新 */
                        ABNFO = (ABNF & 0x0F);/* オールドを更新する */
                        
                        REG_00 = ABNF;/* 最新異常データ */
                        REG_00 &= 0x0F;/* マスク */
                        REG_01 = ABNCUT;/* 一個前の異常データ */
                        REG_01 &= 0xF0;/* マスク */
                        
                        ABNCUT &= 0x0F;/* 4～7bit目をクリア */
                        ABNCUT |= (REG_00 << 4);/* 最新データをセットします */
                        
                        ABNH1 <<= 4;/* 一番古い異常データを押し出し、4番目のデータをセット */
                        REG_00 = ABNH0;/* データロード */
                        REG_00 >>= 4;/* シフト */
                        ABNH1 |= REG_00;/* 3番目の異常をロード */
                        ABNH0 <<= 4;/* 4bitシフト */
                        ABNH0 |= (REG_01 >> 4);/* 2番目のデータセット */
                        
                        REG_00 = ABNCUT;/* データロード */
                        REG_00 &= 0x0F;/* 異常件数のみマスク */
                        REG_00 ++;/* 異常件数をインクリメント */
                        
                        if (REG_00 >= 5) {
                            /* 5件以上になる場合 */
                            REG_00 = 5;/* MAX FIX */
                            
                        }
                        
                        ABNCUT &= 0xF0;
                        ABNCUT |= REG_00;/* 異常件数セット */
                        
                    }/* 異常が変化していた場合ここまで */
                    
                    if (((SYSFLG & 0x02) == 0)
                    || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) != 8) && ((ABNF & 0x0F) != 9) && ((ABNF & 0x0F) != 14))) {
                        /* 運転中ではない、又は運転中で常温槽水位電極棒異常ではなく、常温温度センサー異常ではなく、真空度異常ではない場合 */
                        DSPNO = 6;/* 異常表示をセットする */
                        
                    } else {
                        /* 運転中に、常温槽水位電極棒異常か、常温温度センサー異常か、真空度異常である場合 */
                        if ((STSFL0 & 0x20) == 0) {
                            /* 準備中の場合 */
                            DSPNO = 1;/* 準備中のメッセージセット */
                            
                        } else if ((SYSFLG & 0x1E) == 0) {
                            /* 運転工程ではない場合 */
                            DSPNO = 2;/* 待機表示セット */
                            
                        } else if ((SYSFLG & 0x0C) > 0) {
                            /* 冷却工程であった場合 */
                            DSPNO = 3;/* 冷却工程セット */
                            
                        } else {
                            /* 冷却工程ではない場合 */
                            DSPNO = 4;/* 冷却工程完了セット */
                            
                        }
                        
                    }
                    
                } else {
                    /* 異常がセットされていない場合 */
                    if ((STSFL0 & 0x80) == 0) {
                        /* 設定モードでない場合 */
                        if ((STSFL0 & 0x20) == 0) {
                            /* 準備中の場合 */
                            if ((DSPNO == 0) && (DSPSEQ > 0)) {
                                /* OFF -> ON時であり、画面シーケンスが進んでいた場合 */
                                DSPSEQ = 0;/* 一度クリア */
                                
                            }
                            DSPNO = 1;/* 準備中のメッセージセット */
                            
                        } else if ((SYSFLG & 0x1E) == 0) {
                            /* 運転工程ではない場合 */
                            DSPNO = 2;/* 待機表示セット */
                            
                        } else if ((SYSFLG & 0x0C) > 0) {
                            /* 冷却工程であった場合 */
                            DSPNO = 3;/* 冷却工程セット */
                            
                        } else {
                            /* 冷却工程ではない場合 */
                            DSPNO = 4;/* 冷却工程完了セット */
                            
