ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                        }
                        
                    } else {
                        /* 設定モードの場合 */
                        if ((DSPSEQ != 4) || ((DSPSEQ == 4) && (DSPSSQ == 0))) {
                            /* 洗浄モードではない場合、又は洗浄モードでメインメニューの場合 */
                            if ((DSPNO != 7) && (DSPSEQ > 0)) {
                                /* 設定画面へ変更時であり、画面シーケンスが進んでいた場合 */
                                DSPSEQ = 0;/* 一度クリア */
                                
                            }
                            DSPNO = 7;/* 設定モード表示をセット */
                            
                        } else {
                            /* 洗浄モードでメインメニューでない場合 */
                            DSPNO = 5;/* 洗浄モード表示セット */
                            
                        }
                        
                    }
                    
                }
                /* 電源オンである場合ここまで */
                
            }
            
            DLWSQ++;/* インクリメント */
            DLWSQ += DSPNO;/* 画面番号を加算 */
            i = 0;/* 再度ループに入りなおすため、ループ値をクリア */
            
            break;
            
        case 11:
            /* 時計表示 */
            STSFL0 &= 0xEF;/* ブザー音禁止フラグ */
            TSB_PF_DATA_PF4 = 0;/* バックライトオフ */
            
            if (DSPSEQ == 0) {
                /* 初回の場合 */
                DSPSEQ = 1;/* 1にする */
                DSPTM2 = 0;/* タイマクリア */
                
                memcpy(DSPLB1, CLKMS1 + 1, 16);/* 16バイトコピー */
                memcpy(DSPLB2, CLKMS2 + 1, 16);/* 16バイトコピー */
                DSPLB2[2] = NUMDEG[((RTCDT[6] % 100) / 10)];/* 年10の位 */
                DSPLB2[3] = NUMDEG[(RTCDT[6] % 10)];/* 年１の位 */
                DSPLB2[5] = NUMDEG[((RTCDT[5] % 100) / 10)];/* 月10の位 */
                DSPLB2[6] = NUMDEG[(RTCDT[5] % 10)];/* 月１の位 */
                DSPLB2[8] = NUMDEG[((RTCDT[4] % 100) / 10)];/* 日10の位 */
                DSPLB2[9] = NUMDEG[(RTCDT[4] % 10)];/* 日１の位 */
                DSPLB2[11] = NUMDEG[((RTCDT[2] % 100) / 10)];/* 時10の位 */
                DSPLB2[12] = NUMDEG[(RTCDT[2] % 10)];/* 時1の位 */
                DSPLB2[14] = NUMDEG[((RTCDT[1] % 100) / 10)];/* 分10の位 */
                DSPLB2[15] = NUMDEG[(RTCDT[1] % 10)];/* 分1の位 */
                
                DSPLN1 = 16;/* データ長セット */
                MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                MHEAD1 --;/* アドレスをデクリメント */
                DSPLN2 = 16;/* データ長16をセット */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 25;/* 表示クリアから開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else {
                /* 初回以降である場合 */
                if ((STSFL1 & 0x08) > 0) {
                    /* 手動排水受付中である場合 */
                    TSB_PF_DATA_PF4 = 1;/* バックライトオン */
                    memcpy(DSPLB1, DRAIN1 + 1, 16);/* 16バイトコピー */
                    
                } else if ((STSFL1 & 0x10) > 0) {
                    /* 排水中である場合 */
                    TSB_PF_DATA_PF4 = 1;/* バックライトオン */
                    memcpy(DSPLB1, DRAIN2 + 1, 16);/* 16バイトコピー */
                    
                } else {
                    /* 排水関係が無い場合 */
                    TSB_PF_DATA_PF4 = 0;/* バックライトオフ */
                    memcpy(DSPLB1, CLKMS1+ 1, 16);/* 16バイトコピー */
                    
                }
                
                DSPTM2++;/* タイマインクリメント */
                if ((DSPTM2 < 10) && ((STSFL1 & 0x18) == 0)) {
                    /* タイマが0.5秒未満で、排水関係のフラグが無い場合 */
                    /* 何もしない */
                    
                } else {
                    /* タイマが0.5秒以上か、排水関係のフラグがある場合 */
                    if (DSPTM2 >= 10) {
                        /* タイマが1秒経過した場合 */
                        DSPTM2 = 0;/* クリア */
                        DCLNF ^= 0x01;/* 「：」反転フラグ構築 */
                        
                    }
                    
                    memcpy(DSPLB2, CLKMS2 + 1, 16);/* 16バイトコピー */
                    DSPLB2[2] = NUMDEG[((RTCDT[6] % 100) / 10)];/* 年10の位 */
                    DSPLB2[3] = NUMDEG[(RTCDT[6] % 10)];/* 年１の位 */
                    DSPLB2[5] = NUMDEG[((RTCDT[5] % 100) / 10)];/* 月10の位 */
                    DSPLB2[6] = NUMDEG[(RTCDT[5] % 10)];/* 月１の位 */
                    DSPLB2[8] = NUMDEG[((RTCDT[4] % 100) / 10)];/* 日10の位 */
                    DSPLB2[9] = NUMDEG[(RTCDT[4] % 10)];/* 日１の位 */
                    DSPLB2[11] = NUMDEG[((RTCDT[2] % 100) / 10)];/* 時10の位 */
                    DSPLB2[12] = NUMDEG[(RTCDT[2] % 10)];/* 時1の位 */
                    DSPLB2[14] = NUMDEG[((RTCDT[1] % 100) / 10)];/* 分10の位 */
                    DSPLB2[15] = NUMDEG[(RTCDT[1] % 10)];/* 分1の位 */
                    
                    if ((DCLNF & 0x01) > 0) {
                        /* コロンを消すタイミングである場合 */
                        DSPLB2[13] = 0x20;/* コロン　→　スペース */
                        
                    }
                    
                    DSPLN1 = 16;/* データ長セット */
                    MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                    MHEAD1 --;/* アドレスをデクリメント */
                    DSPLN2 = 16;/* データ長16をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1～２行目表示処理から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }
                
            }/* 初回以降の処理ここまで */
            
            break;
            
        case 12:
            /* TOPメッセージ表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオン */
            
            if (DSPSEQ == 0) {
                /* 表示シーケンスが0である場合 */
                DSPSEQ = 1;/* 1にする */
                
                memcpy(DSPLB1, TOPMS1 + 1, 16);/* 16バイトコピー */
                
                if ((SYKND0 & 0xC0) == 0) {
                    /* 35RCLである場合 */
                    /* 何もしない */
                } else if ((SYKND0 & 0xC0) == 0xC0) {
                    /* 40RCLである場合 */
                    DSPLB1[12] = '4';/* shift-jis */
                    DSPLB1[13] = '0';/* shift-jis */
                    
                } else if ((SYKND0 & 0xC0) == 0x40) {
                    /* 50RCLである場合 */
                    DSPLB1[12] = '5';/* shift-jis */
                    DSPLB1[13] = '0';/* shift-jis */
                    
                } else {
                    /* 100RCLである場合 */
                    DSPLB1[11] = '1';/* shift-jis */
                    DSPLB1[12] = '0';/* shift-jis */
                    DSPLB1[13] = '0';/* shift-jis */
                    
