ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
                DSPLN1 = 16;/* データ長セット */
                MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                MHEAD1 --;/* アドレスをデクリメント */
                
                memset(DSPLB2, 0x20, 16);
                DSPLN2 = 16;/* データ長16をセット */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DSPTM1 = 0;/* タイマをクリアする */
                
                DLWSQ = 25;/* 表示クリアから開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else {
                /* 初回以降である場合 */
                DSPTM1++;/* タイマインクリメント */
                if (DSPTM1 >= 4) {
                    /* タイマが200ms経過した場合 */
                    DSPTM1 = 0;/* タイマークリア */
                    
                    memcpy(DSPLB2, DSPLB2 + 1, 15);/* 15バイトシフト */
                    
                    if (DSPSEQ < 20) {
                        /* 2つ目のメッセージ表示タイミングではない場合 */
                        DSPLB2[15] = TOPMS2[DSPSEQ];
                        
                    } else if (DSPSEQ < 21) {
                        /* スペース表示タイミングである場合 */
                        DSPLB2[15] = 0x20;/* スペース */
                        
                    } else if (DSPSEQ < 37) {
                        /* スペースエリアである場合 */
                        if ((ABNF & 0x30) == 0) {
                            /* 予知警報・チラー異常なしである場合 */
                            DSPLB2[15] = SPACCE[(DSPSEQ - 20)];
                            
                        } else if ((ABNF & 0x30) == 0x20) {
                            /* 予知警報あり、チラー異常なしである場合 */
                            DSPLB2[15] = ALMSG[(DSPSEQ - 20)];
                            
                        } else {
                            /* チラー異常が発生している場合 */
                            DSPLB2[15] = ABN02[(DSPSEQ - 20)];
                            if (((ABNF & 0x40) > 0) && (DSPSEQ < 23)) {
                                /* ブザーフラグがあり、0.4秒以上経過していない場合 */
                                TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                                TSB_PC_DATA_PC7 = 1;/* 外部警報出力をオンする */
                                MXOTN2 |= 0x80;/* ビットをセット */
                                
                            } else {
                                /* ブザーフラグが無い、又は0.4以上経過した場合 */
                                TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                                TSB_PC_DATA_PC7 = 0;/* 外部警報出力をオフする */
                                MXOTN2 &= 0x7F;/* ビットクリア */
                                
                            }
                            
                        }
                        
                    } else if (DSPSEQ < 39) {
                        /* メッセージエンドである場合 */
                        DSPLB2[15] = 0x20;/* スペース */
                        
                    } else {
                        /* それ以外(最終) */
                        DSPLB2[15] = 0x20;/* スペース */
                        DSPSEQ = 0;/* クリア */
                        
                    }
                    
                    DSPSEQ++;/* インクリメント */
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }/* タイマが200ms経過していない場合はここに抜ける */
                
            }
            
            break;
            
        case 13:
            /* 運転待機表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオン */
            
            if (DSPSEQ == 0) {
                /* 1回目である場合 */
                BZTM1 = 0;/* ブザータイマをクリアする */
                if ((STSFL0 & 0x10) == 0) {
                    /* ブザー音禁止では無い場合 */
                    STSFL0 |= 0x40;/* セット　クリック */
                    
                }
                
                DSPSEQ = 1;/* 次回2回目に変更 */
                DSPTM1 = 0;/* タイマクリア */
                
                DSPLN1 = RDYMS1[0];/* 1行目の文字数セット */
                MHEAD1 = RDYMS1;/* 1行目の先頭アドレスをセット */
                
                memcpy(DSPLB2, RDYMS2 + 1, 16);/* 16バイトメモリーコピーする */
                
                if (NPAT == 0) {
                    /* パターン1である場合 */
                    REG_00 = PAT1;/* パターン1の設定温度 */
                    REG_01 = (RPAT & 0x01);/* 徐冷の有無をセット（0なら無し） */
                    
                } else if (NPAT == 1) {
                    /* パターン2である場合 */
                    REG_00 = PAT2;/* パターン2の設定温度 */
                    REG_01 = (RPAT & 0x02);/* 徐冷の有無をセット（0なら無し） */
                    
                } else if (NPAT == 2) {
                    /* パターン3である場合 */
                    REG_00 = PAT3;/* パターン3の設定温度 */
                    REG_01 = (RPAT & 0x04);/* 徐冷の有無をセット（0なら無し） */
                    
                } else {
                    /* パターン4である場合 */
                    REG_00 = PAT4;/* パターン4の設定温度 */
                    REG_01 = (RPAT & 0x08);/* 徐冷の有無をセット（0なら無し） */
                    
                }
                
                DSPLB2[4] = NUMDEG2[((REG_00 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                DSPLB2[5] =  NUMDEG[(REG_00 % 10)];/* 温度1の位 */
                
                if (REG_01 == 0) {
                    /* 徐冷が無い場合 */
                    DSPLB2[14] = 'ﾅ';/* shift-jis */
                    DSPLB2[15] = 'ｼ';/* shift-jis */
                    
                }
                
                DSPLN2 = 16;/* データ長をセット */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSEQ == 1) {
                /* 2回目である場合 */
                BZTM1++;/* ブザータイマをインクリメント */
                
                if (BZTM1 >= 4) {
                    /* 200ms以上経過していた場合 */
                    if (BZTM1 == 4) {
                        /* ジャスト200msであった場合 */
                        if ((STSFL0 & 0x10) == 0) {
                            /* ブザー音禁止では無い場合 */
                            STSFL0 |= 0x40;/* クリックをセット */
                            
