ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                        }
                        
                    }
                    
                    STSFL0 &= 0xEF;/* ブザー禁止フラグをリセットする */
                    BZTM1 = 4;/* FIX */
                    
                }/* 200ms未満の場合はここに抜ける */
                
                DSPTM1++;/* タイマをインクリメント */
                
                if (DSPTM1 < 40) {
                    /* 2秒未満の場合 */
                    DSPLN1 = RDYMS1[0];/* 1行目の文字数セット */
                    MHEAD1 = RDYMS1;/* 1行目の先頭アドレスをセット */
                    
                    memcpy(DSPLB2, RDYMS2 + 1, 16);/* 16バイトメモリーコピーする */
                    
                    if (NPAT == 0) {
                        /* パターン1である場合 */
                        REG_00 = PAT1;/* パターン1の設定温度 */
                        REG_01 = (RPAT & 0x01);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else if (NPAT == 1) {
                        /* パターン2である場合 */
                        REG_00 = PAT2;/* パターン2の設定温度 */
                        REG_01 = (RPAT & 0x02);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else if (NPAT == 2) {
                        /* パターン3である場合 */
                        REG_00 = PAT3;/* パターン3の設定温度 */
                        REG_01 = (RPAT & 0x04);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else {
                        /* パターン4である場合 */
                        REG_00 = PAT4;/* パターン4の設定温度 */
                        REG_01 = (RPAT & 0x08);/* 徐冷の有無をセット（0なら無し） */
                        
                    }
                    
                    DSPLB2[4] = NUMDEG2[((REG_00 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                    DSPLB2[5] =  NUMDEG[(REG_00 % 10)];/* 温度1の位 */
                    
                    if (REG_01 == 0) {
                        /* 徐冷が無い場合 */
                        DSPLB2[14] = 'ﾅ';/* shift-jis */
                        DSPLB2[15] = 'ｼ';/* shift-jis */
                        
                    }
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* 2秒経過した場合 */
                    DSPSEQ = 2;/* シーケンスを3回目にする */
                    DSPTM1 = 0;/* タイマをクリア */
                    /* 再度DLWSQ＝13にて処理やり直しとなる */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* ループ先頭に戻る */
                    
                }
                
            } else if (DSPSEQ == 2) {
                /* 3回目である場合 */
                if ( ((ABNF & 0x30) == 0)
                || (DSPTM1++ >= 40) ) {
                    /* チラー異常と予知警報が無い、又は2秒以上経過した場合 */
                    DSPSEQ = 1;/* 次回2回目に変更 */
                    DSPTM1 = 0;/* タイマクリア */
                    
                    DSPLN1 = RDYMS1[0];/* 1行目の文字数セット */
                    MHEAD1 = RDYMS1;/* 1行目の先頭アドレスをセット */
                    
                    memcpy(DSPLB2, RDYMS2 + 1, 16);/* 16バイトメモリーコピーする */
                    
                    if (NPAT == 0) {
                        /* パターン1である場合 */
                        REG_00 = PAT1;/* パターン1の設定温度 */
                        REG_01 = (RPAT & 0x01);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else if (NPAT == 1) {
                        /* パターン2である場合 */
                        REG_00 = PAT2;/* パターン2の設定温度 */
                        REG_01 = (RPAT & 0x02);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else if (NPAT == 2) {
                        /* パターン3である場合 */
                        REG_00 = PAT3;/* パターン3の設定温度 */
                        REG_01 = (RPAT & 0x04);/* 徐冷の有無をセット（0なら無し） */
                        
                    } else {
                        /* パターン4である場合 */
                        REG_00 = PAT4;/* パターン4の設定温度 */
                        REG_01 = (RPAT & 0x08);/* 徐冷の有無をセット（0なら無し） */
                        
                    }
                    
                    DSPLB2[4] = NUMDEG2[((REG_00 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                    DSPLB2[5] =  NUMDEG[(REG_00 % 10)];/* 温度1の位 */
                    
                    if (REG_01 == 0) {
                        /* 徐冷が無い場合 */
                        DSPLB2[14] = 'ﾅ';/* shift-jis */
                        DSPLB2[15] = 'ｼ';/* shift-jis */
                        
                    }
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }/* チラー異常か予知警報があり、時間が2秒未満である場合はここに抜ける */
                
                if ((ABNF & 0x10) == 0) {
                    /* チラー異常ではなく予知警報がある場合 */
                    DSPLN2 = ALMSG[0];/* データ長をセット */
                    MHEAD2 = ALMSG;/* 文字列の先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* チラー異常がある場合 */
                    if (((ABNF & 0x40) > 0) && (DSPTM1 < 10)) {
                        /* ブザー要求があり、0.5秒未満である場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザー出力をオン */
                        TSB_PC_DATA_PC7 = 1;/* 外部警報出力をオン */
                        MXOTN2 |= 0x80;/* ビットセット */
                        
                    } else {
                        /* ブザー要求が無いか、0.5秒以上経過した場合 */
                        TSB_PC_DATA_PC2 = 0;/* ブザー出力をオフ */
                        TSB_PC_DATA_PC7 = 0;/* 外部警報出力をオフ */
                        MXOTN2 &= 0x7F;/* ビットクリア */
                        
