ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                    }
                    
                    DSPLN2 = ABN02[0];/* データ長をセット */
                    MHEAD2 = ABN02;/* 文字列の先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }
                /* 3回目ここまで */
                
            }
            
            break;
            
        case 14:
            /* 徐冷・冷却工程表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオン */
            
            if ((DSPSEQ == 0) || ((DSPSEQ == 1) && (DSPTM1++ < 40))) {
                /* 1回目である、又は2回目以降で2秒未満である場合 */
                if (DSPSEQ == 0) {
                    /* 1回目に限り */
                    DSPSEQ = 1;/* セット、次回2回目にする */
                    DSPTM1 = 0;/* タイマをクリア */
                    
                }
                
                if ((SYSFLG & 0x08) == 0) {
                    /* 冷却工程ではない場合 */
                    memcpy(DSPLB1, RNMS1 + 1, 16);/* 16バイトメモりーコピー */
                    
                } else {
                    /* 冷却工程中である場合 */
                    memcpy(DSPLB1, RNMS2 + 1, 16);/* 16バイトメモりーこぴー */
                    
                }
                
                memcpy(DSPLB2, RNSTM1 + 1, 16);/* 16バイトメモリーコピー */
                
                if (NPAT == 0) {
                    /* パターン1である場合 */
                    REG_00 = PAT1;/* パターン1の設定温度 */
                    
                } else if (NPAT == 1) {
                    /* パターン2である場合 */
                    REG_00 = PAT2;/* パターン2の設定温度 */
                    
                } else if (NPAT == 2) {
                    /* パターン3である場合 */
                    REG_00 = PAT3;/* パターン3の設定温度 */
                    
                } else {
                    /* パターン4である場合 */
                    REG_00 = PAT4;/* パターン4の設定温度 */
                    
                }
                
                DSPLB1[12] = NUMDEG2[((REG_00 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                DSPLB1[13] =  NUMDEG[(REG_00 % 10)];/* 温度1の位 */
                
                DSPLB2[11] = NUMDEG2[((TMPDT0 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                DSPLB2[12] =  NUMDEG[(TMPDT0 % 10)];/* 温度1の位 */
                
                DSPLN1 = 16;/* データ長をセット */
                MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                MHEAD1 --;/* アドレスをデクリメント */
                
                DSPLN2 = 16;/* データ長をセット */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if ((DSPSEQ == 1) && (DSPTM1 >= 40)) {
                /* 2回目以降で2秒以上経過した場合 */
                DSPSEQ = 2;/* 3回目にセット */
                DSPTM1 = 0;/* タイマクリア */
                
            }
            
            if (DSPSEQ == 2) {
                /* 3回目である場合 */
                DSPTM1++;/* タイマをインクリメント */
                if (DSPTM1 < 40) {
                    /* 2秒経過していない場合 */
                    memcpy(DSPLB2, RNSTM2 + 1, 16);/* メモリーコピー */
                    
                    DSPLB2[10] = NUMDEG2[((STIME2 % 100) / 10)];/* 開始時刻「時」10の位(ゼロは表示しない) */
                    DSPLB2[11] =  NUMDEG[(STIME2 % 10)];/* 開始時刻「時」1の位 */
                    DSPLB2[13] = NUMDEG2[((STIME1 % 100) / 10)];/* 開始時刻「分」10の位(ゼロは表示しない) */
                    DSPLB2[14] =  NUMDEG[(STIME1 % 10)];/* 開始時刻「分」1の位 */
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* 2秒経過した場合 */
                    DSPSEQ = 3;/* 次の4回目表示へ */
                    DSPTM1 = 0;/* タイマークリア */
                    
                }
                
            }
            
            if (DSPSEQ == 3) {
                /* 4回目である場合 */
                DSPTM1++;/* タイマをインクリメント */
                if (DSPTM1 < 40) {
                    /* 2秒経過していない場合 */
                    memcpy(DSPLB2, RNSTM3 + 1, 16);/* メモリーコピー */
                    
                    DSPLB2[10] = NUMDEG2[((CSEQTM % 1000) / 100)];/* シーケンス時間の100の位(ゼロは表示しない) */
                    if (CSEQTM >= 10) {
                        /* 10の位ありの場合 */
                        DSPLB2[11] = NUMDEG[((CSEQTM % 100) / 10)];/* シーケンス時間の10の位 */
                        
                    }/* 10の位無しの場合は何もしない */
                    DSPLB2[12] =  NUMDEG[(CSEQTM % 10)];/* シーケンス時間の1の位 */
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* 2秒経過した場合 */
                    DSPSEQ = 4;/* 次の5回目の表示へ */
                    DSPTM1 = 0;/* タイマークリア */
                    
                }
                
            }
            
            if (DSPSEQ == 4) {
                /* 5回目である場合 */
                if (((ABNF & 0x3F) == 0) || (DSPTM1++ >= 40)) {
                    /* 異常か予知警報が無い場合、又は2秒以上経過した場合 */
                    i = 0;/* 再度ループ入りなおし可 */
                    DSPTM1 = 0;/* タイマクリア */
                    DSPSEQ = 1;/* シーケンス番号を戻す */
                    continue;/* ループの先頭へ戻る */
                    
                }/* 異常があって、タイマが2秒未満の場合はここに抜ける */
                
                if ((ABNF & 0x1F) == 0) {
                    /* 予知警報であった場合 */
                    DSPLN2 = ALMSG[0];/* データ長をセット */
                    MHEAD2 = ALMSG;/* 先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
