ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
                if (((ABNF & 0x40) > 0) && (DSPTM1 < 10)) {
                    /* ブザー要求があり、0.5秒未満である場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザー出力をオン */
                    TSB_PC_DATA_PC7 = 1;/* 外部警報出力をオン */
                    MXOTN2 |= 0x80;/* ビットセット */
                    
                } else {
                    /* ブザー要求が無いか、0.5秒以上経過した場合 */
                    TSB_PC_DATA_PC2 = 0;/* ブザー出力をオフ */
                    TSB_PC_DATA_PC7 = 0;/* 外部警報出力をオフ */
                    MXOTN2 &= 0x7F;/* ビットクリア */
                    
                }
                
                if ((ABNF & 0x0F) == 0) {
                    /* チラー異常(継続)であった場合 */
                    DSPLN2 = ABN02[0];/* データ長をセット */
                    MHEAD2 = ABN02;/* 先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* それ以外の異常であった場合 */
                    if (((SYKND0 & 0x10) > 0) && ((ABNF & 0x0F) == 8)) {
                        /* 蒸気式であり、常温槽水位電極棒異常である場合 */
                        DSPLN2 = ABNFSTBL[17][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[17];/* 先頭アドレス */
                        
                    } else if (((SYKND0 & 0x10) > 0) && ((ABNF & 0x0F) == 9)) {
                        /* 蒸気式であり、常温槽水槽温度センサー異常である場合 */
                        DSPLN2 = ABNFSTBL[18][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[18];/* 先頭アドレス */
                        
                    } else {
                        /* それ以外の場合 */
                        DSPLN2 = ABNFSTBL[(ABNF & 0x0F)][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[(ABNF & 0x0F)];/* 先頭アドレス */
                        
                    }
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }
                /* 5回目ここまで */
                
            }
            
            break;
            
        case 15:
            /* 冷却工程完了表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライト出力オン */
            
            if ((DSPSEQ == 0) || ((DSPSEQ == 1) && (DSPTM1++ < 40))) {
                /* 1回目である、又は2回目以降で2秒未満である場合 */
                if (DSPSEQ == 0) {
                    /* 1回目に限り */
                    DSPSEQ = 1;/* セット、次回2回目にする */
                    DSPTM1 = 0;/* タイマをクリア */
                    
                }
                
                if (CCSEQ == 15) {
                    /* 完了表示タイミングである場合 */
                    memcpy(DSPLB1, ENDMS1 + 1, 16);/* メモリーコピー */
                    
                } else {
                    /* 完了以外のタイミングである場合 */
                    memcpy(DSPLB1, DESVC1 + 1, 16);/* メモリーコピー */
                    
                }
                
                memcpy(DSPLB2, RNSTM1 + 1, 16);/* 品温表示メモリーコピー */
                
                if (CCSEQ == 15) {
                    /* 完了表示タイミングである場合 */
                    if (NPAT == 0) {
                        /* パターン1の場合 */
                        REG_00 = PAT1;/* パターン1の温度をセット */
                        
                    } else if (NPAT == 1) {
                        /* パターン2の場合 */
                        REG_00 = PAT2;/* パターン2の温度をセット */
                        
                    } else if (NPAT == 2) {
                        /* パターン3の場合 */
                        REG_00 = PAT3;/* パターン3の温度をセット */
                        
                    } else {
                        /* パターン4の場合 */
                        REG_00 = PAT4;/* パターン4の温度をセット */
                        
                    }
                    
                    DSPLB1[12] = NUMDEG2[((REG_00 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                    DSPLB1[13] =  NUMDEG[(REG_00 % 10)];/* 温度1の位 */
                    
                }
                
                DSPLB2[11] = NUMDEG2[((TMPDT0 % 100) / 10)];/* 温度10の位(ゼロは表示しない) */
                DSPLB2[12] =  NUMDEG[(TMPDT0 % 10)];/* 温度1の位 */
                
                DSPLN1 = 16;/* データ長をセット */
                MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                MHEAD1 --;/* アドレスをデクリメント */
                
                DSPLN2 = 16;/* データ長をセット */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if ((DSPSEQ == 1) && (DSPTM1 >= 40)) {
                /* 2回目以降で2秒以上経過した場合 */
                DSPSEQ = 2;/* 3回目の処理へ */
                DSPTM1 = 0;/* タイマクリア */
                
            }
            
            if (DSPSEQ == 2) {
                /* 3回目の処理である場合 */
                if (DSPTM1++ < 40) {
                    /* タイムアップしていない場合 */
                    memcpy(DSPLB2, RNSTM2 + 1, 16);/* 開始時刻表示をメモリーコピー */
                    
                    DSPLB2[10] = NUMDEG2[((STIME2 % 100) / 10)];/* 開始時刻「時」10の位(ゼロは表示しない) */
                    DSPLB2[11] =  NUMDEG[(STIME2 % 10)];/* 開始時刻「時」1の位 */
                    DSPLB2[13] = NUMDEG2[((STIME1 % 100) / 10)];/* 開始時刻「分」10の位(ゼロは表示しない) */
                    DSPLB2[14] =  NUMDEG[(STIME1 % 10)];/* 開始時刻「分」1の位 */
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* タイムアップした場合 */
                    DSPSEQ = 3;/* 4回目の処理へ */
                    DSPTM1 = 0;/* タイマクリア */
                    
