ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
            }
            
            if (DSPSEQ == 3) {
                /* 4回目の処理である場合 */
                if (DSPTM1++ < 40) {
                    /* タイムアップしていない場合 */
                    memcpy(DSPLB2, ENDMS2 + 1, 16);/* 終了時刻表示をメモリーコピー */
                    
                    DSPLB2[10] = NUMDEG2[((ETIME2 % 100) / 10)];/* 終了時刻「時」10の位(ゼロは表示しない) */
                    DSPLB2[11] =  NUMDEG[(ETIME2 % 10)];/* 終了時刻「時」1の位 */
                    DSPLB2[13] = NUMDEG2[((ETIME1 % 100) / 10)];/* 終了時刻「分」10の位(ゼロは表示しない) */
                    DSPLB2[14] =  NUMDEG[(ETIME1 % 10)];/* 終了時刻「分」1の位 */
                    
                    DSPLN2 = 16;/* データ長をセット */
                    MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* タイムアップした場合 */
                    DSPSEQ = 4;/* 5回目の処理へ */
                    DSPTM1 = 0;/* タイマクリア */
                    
                }
                
            }
            
            if (DSPSEQ == 4) {
                /* 5回目の処理であった場合 */
                if (((ABNF & 0x3F) == 0) || (DSPTM1++ >= 40)) {
                    /* 異常か予知警報が無い場合、又は2秒以上経過した場合 */
                    i = 0;/* 再度ループ入りなおし可 */
                    DSPTM1 = 0;/* タイマクリア */
                    DSPSEQ = 1;/* シーケンス番号を戻す */
                    continue;/* ループの先頭へ戻る */
                    
                }/* 異常があって、タイマが2秒未満の場合はここに抜ける */
                
                if ((ABNF & 0x1F) == 0) {
                    /* 予知警報であった場合 */
                    DSPLN2 = ALMSG[0];/* データ長をセット */
                    MHEAD2 = ALMSG;/* 先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }
                
                ABNF &= 0xBF;/* 継続異常警報(ブザー)フラグをリセットする */
                
                if ((ABNF & 0x0F) == 0) {
                    /* チラー異常(継続)であった場合 */
                    DSPLN2 = ABN02[0];/* データ長をセット */
                    MHEAD2 = ABN02;/* 先頭アドレスをセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* それ以外の異常であった場合 */
                    if (((SYKND0 & 0x10) > 0) && ((ABNF & 0x0F) == 8)) {
                        /* 蒸気式であり、常温槽水位電極棒異常である場合 */
                        DSPLN2 = ABNFSTBL[17][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[17];/* 先頭アドレス */
                        
                    } else if (((SYKND0 & 0x10) > 0) && ((ABNF & 0x0F) == 9)) {
                        /* 蒸気式であり、常温槽水槽温度センサー異常である場合 */
                        DSPLN2 = ABNFSTBL[18][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[18];/* 先頭アドレス */
                        
                    } else {
                        /* それ以外の場合 */
                        DSPLN2 = ABNFSTBL[(ABNF & 0x0F)][0];/* データ長 */
                        MHEAD2 = ABNFSTBL[(ABNF & 0x0F)];/* 先頭アドレス */
                        
                    }
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                }
                /* 5回目ここまで */
                
            }
            
            break;
            
        case 16:
            /* 洗浄モード表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオンする */
            
            if (DSPSSQ == 1) {
                /* 洗浄モード選択表示 */
                DSPLN1 = CLEAN1[0];/* データ長をセット */
                MHEAD1 = CLEAN1;/* 1行目先頭アドレスをセット */
                
                memcpy(DSPLB2, CLEAN2 + 1, 16);/* メモリーコピー */
                DSPLN2 = 16;/* データ長セット */
                if (EDDT[0] > 0) {
                    /* 「ハイ」選択中である場合 */
                    DSPLB2[2] = '(';
                    DSPLB2[5] = ')';
                    DSPLB2[9] = ' ';
                    DSPLB2[13] = ' ';/* shift-jis */
                    
                }
                
                MHEAD2 = DSPLB2;/* ｱﾄﾞﾚｽセット */
                MHEAD2--;/* アジャスト */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSSQ == 2) {
                /* 洗浄工程表示である場合 */
                DSPLN1 = CLEAN4[0];/* データ長をセット */
                MHEAD1 = CLEAN4;/* 1行目先頭アドレスをセット */
                
                if (CCSEQ < 23) {
                    /* 洗浄工程中である場合 */
                    MHEAD2 = CLEAN5;/* 2行目の先頭アドレスをセット */
                    
                } else if (CCSEQ < 25) {
                    /* 1回目のすすぎ工程である場合 */
                    MHEAD2 = CLEAN6;/* 2行目の先頭アドレスをセット */
                    
                } else if (CCSEQ < 27) {
                    /* 2回目のすすぎ工程である場合 */
                    MHEAD2 = CLEAN7;/* 2行目の先頭アドレスをセット */
                    
                } else {
                    /* 洗浄終了である場合 */
                    MHEAD2 = CLEAN8;/* 2行目の先頭アドレスをセット */
                    
                }
                DSPLN2 = 16;/* データ長をセットする */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else {
                /* 継続/中止選択画面である場合 */
                DSPLN1 = CLEAN4[0];/* データ長をセット */
                MHEAD1 = CLEAN4;/* 1行目先頭アドレスをセット */
                
                memcpy(DSPLB2, CLEAN3 + 1, 16);/* メモリーコピー */
                DSPLN2 = 16;/* データ長セット */
                if (EDDT[0] > 0) {
                    /* 「ハイ」選択中である場合 */
                    DSPLB2[1] = '(';
                    DSPLB2[6] = ')';
                    DSPLB2[8] = ' ';
                    DSPLB2[14] = ' ';/* shift-jis */
                    
