ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
                MHEAD2 = DSPLB2;/* ｱﾄﾞﾚｽセット */
                MHEAD2--;/* アジャスト */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            }
            
            break;
            
        case 17:
            /* 異常表示 */
            if (DSPSEQ == 0) {
                /* 最初である場合 */
                DSPSEQ = 1;/* 次のシーケンスにする */
                BZTM1 = BZTM2 = 0;/* ブザー制御用タイマをクリア */
                DSPTM1 = 0;/* タイマ―クリア */
                STSFL0 &= 0x7F;/* 設定モードの強制解除 */
                TSB_PC_DATA_PC7 = 1;/* 外部警報出力をオンする */
                MXOTN2 |= 0x80;/* ビットセット */
                
            }
            
            TSB_PF_DATA_PF4 = 0;/* バックライトオフ */
            DSPTM1++;/* タイマインクリメント */
            if (DSPTM1 >= 20) {
                /* タイマが1秒経過した場合 */
                DSPTM1 = 0;/* タイマクリア */
                
            }
            
            if (DSPTM1 < 10) {
                /* タイマが0.5秒未満である場合 */
                TSB_PF_DATA_PF4 = 1;/* バックライトオン */
                
            }
            
            DSPLN2 = ABNTOP[0];/* 異常表示2行目のデータ長をセット */
            MHEAD2 = ABNTOP;/* 先頭アドレスをセット */
            
            if (((SYKND0 & 0x10) > 0) && ((ABNFO & 0x0F) == 2)) {
                /* 蒸気式であり、チラー一括異常である場合 */
                DSPLN1 = ABNFSTBL[16][0];/* クーリングタワー異常のデータ長 */
                memcpy(DSPLB1, ABNFSTBL[16] + 2, 15);/* オフセット先頭アドレス */
                
            } else if (((SYKND0 & 0x10) > 0) && ((ABNFO & 0x0F) == 8)) {
                /* 蒸気式であり、常温槽水位電極棒異常である場合 */
                DSPLN1 = ABNFSTBL[17][0];/* 水位電極棒異常データ長 */
                memcpy(DSPLB1, ABNFSTBL[17] + 2, 15);/* オフセット先頭アドレス */
                
            } else if (((SYKND0 & 0x10) > 0) && ((ABNFO & 0x0F) == 9)) {
                /* 蒸気式であり、常温槽水槽温度センサー異常である場合 */
                DSPLN1 = ABNFSTBL[18][0];/* 温度センサー異常データ長 */
                memcpy(DSPLB1, ABNFSTBL[18] + 2, 15);/* オフセット先頭アドレス */
                
            } else {
                /* それ以外の場合 */
                DSPLN1 = ABNFSTBL[(ABNFO & 0x0F)][0];/* データ長 */
                memcpy(DSPLB1, ABNFSTBL[(ABNFO & 0x0F)] + 2, 15);/* オフセット先頭アドレス */
                
            }
            
            DSPLB1[10] = DSPLB1[11] = ' ';/* スペース文字 */
            DSPLB1[12] = DSPLB1[13] = ' ';/* スペース文字 */
            DSPLB1[14] = DSPLB1[15] = ' ';/* スペース文字 */
            
            MHEAD1 = DSPLB1;/* 先頭アドレスをセットする */
            MHEAD1 --;/* デクリメント */
            
            if ((ABNF & 0x80) == 0) {
                /* ブザー出力がオフである場合 */
                TSB_PC_DATA_PC7 = 0;/* 警報外部出力をオフにする */
                MXOTN2 &= 0x7F;/* ビットクリア */
                
            } else {
                /* ブザー出力がオンになっている場合 */
                if (BZSEQ == 0) {
                    /* ブザーシーケンスが0である場合 */
                    BZTM1 = BZTM2 = 0;/* タイマ―クリア */
                    BZSEQ++;/* 次のシーケンスへ */
                    
                }
                
                if (BZSEQ == 1) {
                    /* ブザーシーケンスが1の場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    BZTM1++;/* タイマをインクリメント */
                    if (BZTM1 >= 20) {
                        /* 1秒経過した場合 */
                        BZTM1 = 0;/* クリア */
                        BZSEQ++;/* 次へ */
                        
                    }
                    
                } else {
                    /* ブザーシーケンスが2の場合 */
                    TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                    BZTM1++;/* タイマをインクリメント */
                    if (BZTM1 >= 20) {
                        /* 1秒経過した場合 */
                        BZTM1 = 0;/* クリア */
                        BZSEQ = 1;/* 次へ */
                        
                    }
                    
                }
                
            }
            
            DLWSQ = 29;/* 1,2行目表示から開始 */
            i = 0;/* 再度ループに入りなおし可 */
            continue;/* 先頭に戻る */
            
            break;
            
        case 18:
            /* 設定表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオンする */
            
            if (DSPSEQ == 0) {
                /* 1回目であった場合 */
                DSPTM1 = 0;/* タイマクリア */
                DSPSEQ = 1;/* 2回目の処理へ */
                
                DSPLN1 = DSMDHD[0];/* データ長をセット */
                MHEAD1 = DSMDHD;/* 先頭アドレスをセット */
                
                DSPLN2 = DSMD01[0];/* データ長をセット */
                MHEAD2 = DSMD01;/* 先頭アドレスをセット */
                
                DLWSQ = 25;/* 画面クリアと1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            }/* 2回目以降はここに抜ける */
            
            if (DSPSSQ == 0) {
                /* サブシーケンス番号が0である場合 */
                DSPLN2 = 16;/* データ長をセット */
                MHEAD2 = DSMDSTBL_1[(DSPSEQ - 1)];/* 先頭アドレスをセット */
                
                DLWSQ = 33;/* 2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            }/* サブシーケンス番号が1以上の場合はここに抜ける */
            
            if (DSPSEQ == 1) {
                /* パターン設定である場合 */
                DSPLN1 = DSMD06[0];/* データ長をセット */
                memcpy(DSPLB1, DSMD06 + 1, 16);/* メモリーコピー */
                
                DSPLN2 = 16;/* データ長をセット */
                memcpy(DSPLB2, DSMDSTBL_1[(DSPSSQ - 1) + 8] + 1, 16);/* メモリーコピー */
                
                DSPLB1[7] = NUMDEG[(NPAT + 1) % 10];/* 1行目データ（パターン番号）をセット */
                
                if (DSPSSQ == 2) {
                    /* 徐冷あり/なしの設定である場合 */
                    if ((EDDT[0] & (0x01 << NPAT)) == 0) {
                        /* 現在選択中のパターンが徐冷無しである場合 */
                        DSPLB2[13] = 'ﾅ';/* shift-jis */
                        DSPLB2[14] = 'ｼ';/* shift-jis */
                        
