ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                    }
                    
                } else {
                    /* それ以外の設定である場合 */
                    DSPLB2[12] = NUMDEG2[((EDDT[0] % 100) / 10)];/* 設定値10の位(ゼロは表示しない) */
                    DSPLB2[13] =  NUMDEG[(EDDT[0] % 10)];/* 設定値1の位 */
                    
                }
                
                MHEAD1 = DSPLB1;/* メッセージの先頭アドレスをセット */
                MHEAD1 --;/* アドレスをデクリメント */
                MHEAD2 = DSPLB2;/* メッセージの先頭アドレスをセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSEQ == 2) {
                /* 常温槽水槽温度設定である場合 */
                DSPLN1 = DSMD10[0];/* データ長 */
                MHEAD1 = DSMD10;/* 先頭アドレスセット */
                
                DSPLN2 = DSMD11[0];/* データ長 */
                memcpy(DSPLB2, DSMD11 + 1, 16);/* 常温槽設定水温セット */
                DSPLB2[12] = NUMDEG2[((EDDT[0] % 100) / 10)];/* 設定値10の位(ゼロは表示しない) */
                DSPLB2[13] =  NUMDEG[(EDDT[0] % 10)];/* 設定値1の位 */
                
                MHEAD2 = DSPLB2;/* 先頭アドレスセット */
                MHEAD2 --;/* アドレスをデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSEQ == 3) {
                /* 自動排水設定である場合 */
                DSPLN1 = DSMD11A[0];/* データ長をセットする */
                MHEAD1 = DSMD11A;/* 先頭アドレスをセット */
                
                if ((EDDT[0] & 0x80) == 0) {
                    /* 自動排水ありの場合 */
                    DSPLN2 = DSMD11B[0];/* データ長セット */
                    MHEAD2 = DSMD11B;/* 先頭アドレスセット */
                    
                } else {
                    /* 自動排水無しの場合 */
                    DSPLN2 = DSMD11C[0];/* データ長セット */
                    MHEAD2 = DSMD11C;/* 先頭アドレスセット */
                    
                }
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSEQ == 5) {
                /* チラー予約設定である場合 */
                DSPTM2++;/* タイマインクリメント */
                
                if (DSPTM2 >= 10) {
                    /* 0.5秒経過したとき */
                    DSPTM2 = 0;/* タイマクリア */
                    DCLNF ^= 0x01;/* XOR 0x01 */
                    
                }
                
                DSPLN1 = DSMD12[0];/* データ長 */
                memcpy(DSPLB1, DSMD12 + 1, 16);/* 現在時刻設定セット */
                
                DSPLN2 = DSMD13[0];/* データ長 */
                memcpy(DSPLB2, DSMD13 + 1, 16);/* チラー予約時刻設定セット */
                
                /* 現在時刻 */
                DSPLB1[11] = NUMDEG2[((RTCDT[2] % 100) / 10)];/* 10の位(ゼロは表示しない) */
                DSPLB1[12] =  NUMDEG[(RTCDT[2] % 10)];/* 1の位 */
                DSPLB1[14] = NUMDEG2[((RTCDT[1] % 100) / 10)];/* 10の位(ゼロは表示しない) */
                DSPLB1[15] =  NUMDEG[(RTCDT[1] % 10)];/* 1の位 */
                
                /* チラー予約設定時刻 */
                DSPLB2[11] = NUMDEG2[((EDDT[1] % 100) / 10)];/* 10の位(ゼロは表示しない) */
                DSPLB2[12] =  NUMDEG[(EDDT[1] % 10)];/* 1の位 */
                DSPLB2[14] =  NUMDEG[((EDDT[0] % 100) / 10)];/* 10の位 */
                DSPLB2[15] =  NUMDEG[(EDDT[0] % 10)];/* 1の位 */
                
                if ((DCLNF & 0x01) == 0) {
                    /* コロン点灯タイミングである場合 */
                    if (DSPSSQ == 1) {
                        /* 時の編集時である場合 */
                        DSPLB2[11] = DSPLB2[12] = ' ';/* 空白 */
                        
                    } else {
                        /* 分の編集時である場合 */
                        DSPLB2[14] = DSPLB2[15] = ' ';/* 空白 */
                        
                    }
                    
                } else {
                    /* コロン消灯タイミングである場合 */
                    DSPLB1[13] = ' ';/* 空白 */
                    
                }
                
                MHEAD1 = DSPLB1;/* 先頭アドレスセット */
                MHEAD2 = DSPLB2;
                MHEAD1 --;/* アドレスデクリメント */
                MHEAD2 --;/* アドレスデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else if (DSPSEQ == 6) {
                /* 時刻設定である場合 */
                DSPTM2++;/* タイマインクリメント */
                
                if (DSPTM2 >= 10) {
                    /* 0.5秒経過したとき */
                    DSPTM2 = 0;/* タイマクリア */
                    DCLNF ^= 0x01;/* XOR 0x01 */
                    
                }
                
                DSPLN1 = DSMD14[0];/* データ長をセット */
                MHEAD1 = DSMD14;/* 1行目のメッセージセット */
                
                DSPLN2 = DSMD15[0];/* データ長セット */
                memcpy(DSPLB1, DSMD15 + 1, 16);/* メモリーコピー */
                
                /* 年 */
                DSPLB2[2] =  NUMDEG[((EDDT[4] % 100) / 10)];/* 10の位 */
                DSPLB2[3] =  NUMDEG[(EDDT[4] % 10)];/* 1の位 */
                /* 月 */
                DSPLB2[5] =  NUMDEG[((EDDT[3] % 100) / 10)];/* 10の位 */
                DSPLB2[6] =  NUMDEG[(EDDT[3] % 10)];/* 1の位 */
                /* 日 */
                DSPLB2[8] =  NUMDEG[((EDDT[2] % 100) / 10)];/* 10の位 */
                DSPLB2[9] =  NUMDEG[(EDDT[2] % 10)];/* 1の位 */
                /* 時 */
                DSPLB2[11] = NUMDEG2[((EDDT[1] % 100) / 10)];/* 10の位 */
                DSPLB2[12] =  NUMDEG[(EDDT[1] % 10)];/* 1の位 */
                /* 分 */
                DSPLB2[14] =  NUMDEG[((EDDT[0] % 100) / 10)];/* 10の位 */
                DSPLB2[15] =  NUMDEG[(EDDT[0] % 10)];/* 1の位 */
                
                if ((DCLNF & 0x01) > 0) {
                    /* 消灯タイミングである場合 */
                    DSPLB2[((DSPSSQ - 1) * 3) + 2] = ' ';/* スペース */
                    DSPLB2[((DSPSSQ - 1) * 3) + 3] = ' ';/* スペース */
                    
