ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
                MHEAD2 = DSPLB2;/* 先頭アドレスセット */
                MHEAD2 --;/* アドレスデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                continue;/* 先頭に戻る */
                
            } else {
                /* メンテナンスモードでの設定 */
                DSPLN1 = DSMD16[0];/* データ長をセットする */
                MHEAD1 = DSMD16;/* 先頭アドレスをセット */
                
                if (DSPSSQ == 1) {
                    /* 異常履歴表示モードである場合 */
                    if (DABHP == 0) {
                        /* 単純表示の場合 */
                        DSPLN2 = DSMD17[0];/* データ長をセット */
                        memcpy(DSPLB2, DSMD17 + 1, 16);/* メモリーコピー */
                        
                        DSPLB2[13] = NUMDEG[(ABNCUT & 0x0F) % 10];/* 異常履歴件数の数字をセット */
                        
                        MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                        MHEAD2 --;/* アドレスをデクリメント */
                        
                        DLWSQ = 29;/* 1,2行目表示から開始 */
                        i = 0;/* 再度ループに入りなおし可 */
                        continue;/* 先頭に戻る */
                        
                    } else {
                        /* 詳細表示である場合 */
                        REG_00 = 0;/* 一旦クリア */
                        if (DABHP == 1) {
                            /* 最新表示の場合 */
                            REG_00 = ABNCUT;/* 最新異常をセット */
                            REG_00 >>= 4;/* 4bit右シフト */
                            
                        } else if (DABHP == 2) {
                            /* 2番目の表示の場合 */
                            REG_00 = ABNH0;/* 2番目の異常をセット */
                            REG_00 &= 0x0F;/* マスク */
                            
                        } else if (DABHP == 3) {
                            /* 3番目の表示の場合 */
                            REG_00 = ABNH0;/* 3番目の異常をセット */
                            REG_00 >>= 4;/* 4bit右シフト */
                            
                        } else if (DABHP == 4) {
                            /* 4番目の表示の場合 */
                            REG_00 = ABNH1;/* 4番目の異常をセット */
                            REG_00 &= 0x0F;/* マスク */
                            
                        } else {
                            /* 5番目の表示の場合 */
                            REG_00 = ABNH1;/* 5番目の異常をセット */
                            REG_00 >>= 4;/* 4bit右シフト */
                            
                        }
                        
                        if (((SYKND0 & 0x10) > 0) && (REG_00 == 2)) {
                            /* 蒸気式で、チラー一括異常である場合 */
                            DSPLN2 = ABN16[0];
                            memcpy(DSPLB2, ABN16 + 1, 16);/* クーリングタワー一括異常をロード */
                            
                        } else if (((SYKND0 & 0x10) > 0) && (REG_00 == 8)) {
                            /* 蒸気式で、常温槽水位電極棒異常である場合 */
                            DSPLN2 = ABN17[0];
                            memcpy(DSPLB2, ABN17 + 1, 16);/* 水位電極棒異常をロード */
                            
                        } else if (((SYKND0 & 0x10) > 0) && (REG_00 == 9)) {
                            /* 蒸気式で、常温槽水温温度センサー異常である場合 */
                            DSPLN2 = ABN18[0];
                            memcpy(DSPLB2, ABN18 + 1, 16);/* 水温センサ異常をロード */
                            
                        } else {
                            /* それ以外の場合 */
                            DSPLN2 = ABNFSTBL[REG_00][0];/* データ長セット */
                            memcpy(DSPLB2, ABNFSTBL[REG_00] + 1, 16);/* 異常の文字列ロード */
                            
                        }
                        
                        DSPLB2[0] = NUMDEG[(DABHP % 10)];/* 履歴番号をshift-jisでセットする */
                        
                        MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                        MHEAD2 --;/* アドレスをデクリメント */
                        
                        DLWSQ = 29;/* 1,2行目表示から開始 */
                        i = 0;/* 再度ループに入りなおし可 */
                        continue;/* 先頭に戻る */
                        
                    }
                    
                } else if (DSPSSQ == 2) {
                    /* 予知警報画面である場合 */
                    if ((ABNF & 0x20) == 0) {
                        /* 予知警報ビットがクリアされている場合 */
                        YOTINO = 0;/* 予知表示ナンバーをクリア */
                        DSPLN2 = DSMD18[0];/* データ長セット */
                        memcpy(DSPLB2, DSMD18 + 1, 16);/* データをロード */
                        
                        DSPLB2[13] = 'ﾅ';
                        DSPLB2[14] = 'ｼ';/* shift-jis */
                        
                    } else if (((ABNF & 0x20) > 0) && (YOTINO == 0)) {
                        /* 予知警報ありで、詳細表示ではない場合 */
                        YOTINO = 0;/* 予知表示ナンバーをクリア */
                        DSPLN2 = DSMD18[0];/* データ長セット */
                        memcpy(DSPLB2, DSMD18 + 1, 16);/* データをロード */
                        
                    } else {
                        /* それ以外の場合 */
                        DSPLN2 = DALM1[0];/* データ長セット */
                        memcpy(DSPLB2, DALM1 + 1, 16);/* チラー能力低下を表示 */
                        
                    }
                    
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (DSPSSQ == 3) {
                    /* 稼働時間表示である場合 */
                    DSPLN2 = DSMD19[0];/* データ長をロード */
                    memcpy(DSPLB2, DSMD19 + 1, 16);/* 設備稼働時間文字列をメモリーコピー */
                    
                    REG_02 = (uint32_t)RTIMH2;/* 設備稼働時間の上位ロード */
                    REG_02 <<= 8;/* 8bit 左シフト */
                    REG_02 |= (uint32_t)RTIMH1;/* 設備稼働時間の下位ロード */
                    
                    DSPLB2[11] = NUMDEG[(REG_02 % 100000) / 10000];/* 1万の位セット */
                    DSPLB2[12] = NUMDEG[(REG_02 % 10000) / 1000];/* 1000の位セット */
                    DSPLB2[13] = NUMDEG[(REG_02 % 1000) / 100];/* 100の位セット */
                    DSPLB2[14] = NUMDEG[(REG_02 % 100) / 10];/* 10の位セット */
                    DSPLB2[15] = NUMDEG[REG_02 % 10];/* 1の位セット */
                    
