ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (DSPSSQ == 4) {
                    /* 常温槽温度表示である場合 */
                    DSPLN2 = DSMD20[0];/* データ長セット */
                    memcpy(DSPLB2, DSMD20 + 1, 16);/* メモリーコピー */
                    
                    DSPLB2[12] = NUMDEG2[(TMPDT2 % 100) / 10];/* 10の位 */
                    DSPLB2[13] = NUMDEG[TMPDT2 % 10];/* 1の位 */
                    
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (DSPSSQ == 5) {
                    /* 低温槽温度表示である場合 */
                    DSPLN2 = DSMD21[0];/* データ長セット */
                    memcpy(DSPLB2, DSMD21 + 1, 16);/* メモリーコピー */
                    
                    DSPLB2[12] = NUMDEG2[(TMPDT1 % 100) / 10];/* 10の位 */
                    DSPLB2[13] = NUMDEG[TMPDT1 % 10];/* 1の位 */
                    
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (DSPSSQ == 6) {
                    /* 品温表示である場合 */
                    DSPLN2 = DSMD22[0];/* データ長セット */
                    memcpy(DSPLB2, DSMD22 + 1, 16);/* メモリーコピー */
                    
                    DSPLB2[12] = NUMDEG2[(TMPDT0 % 100) / 10];/* 10の位 */
                    DSPLB2[13] = NUMDEG[TMPDT0 % 10];/* 1の位 */
                    
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスをデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (MMODE == 0) {
                    /* 総排水モードである場合 */
                    DSPLN2 = DSMD23[0];/* データ長セット */
                    MHEAD2 = DSMD23;/* 先頭アドレスをセットする */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (MMODE == 1) {
                    /* 常温槽排水モードである場合 */
                    DSPLN2 = DSMD231[0];/* データ長セット */
                    MHEAD2 = DSMD231;/* 先頭アドレスをセットする */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else if (MMODE == 2) {
                    /* 低温槽排水モードである場合 */
                    DSPLN2 = DSMD232[0];/* データ長セット */
                    MHEAD2 = DSMD232;/* 先頭アドレスをセットする */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    continue;/* 先頭に戻る */
                    
                } else {
                    /* それ以外の表示の場合 */
                    MMDTM++;/* タイマインクリメント */
                    if (MMDTM < 10) {
                        /* 0.5秒経過していない場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSFL1 |= 0x04;/* マニュアルモード操作エラーフラグをセット */
                        
                    } else {
                        /* 0.5秒以上経過した場合 */
                        TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                        STSFL1 &= 0xFB;/* マニュアルモード操作エラーフラグをクリア */
                        
                        if (MMDTM >= 20) {
                            /* 2秒以上経過した場合 */
                            MMODE = 0;/* マニュアルモードをクリア */
                            MMDTM = 0;/* タイマクリア */
                            INDPTM = 0;/* 通常表示復帰タイマをクリア */
                            
                            STSFL0 &= 0x7F;/* 設定モードをクリア */
                            DSPSEQ = 0;/* ディスプレーシーケンスをクリアする */
                            DSPSSQ = 0;/* サブシーケンスをクリア */
                            
                        }
                        
                    }
                    
                    DSPLN2 = DSMD23E[0];/* データ長セット */
                    MHEAD2 = DSMD23E;/* 先頭アドレスをセットする */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    
                }
                
            }
            
            break;
            
        case 19:
            /* セルフテストモードの表示 */
            TSB_PF_DATA_PF4 = 1;/* バックライトオン */
            
            if (TNO == 1) {
                /* セルフテストスタート時 */
                MXOTN6 = 0;/* LED出力を全てオフにする */
                MX6BLK = 0;/* LEDの点滅要求をリセット */
                MXOTN0 = 0;/* 出力をクリアする */
                MXOTN1 = 0;/* 出力をクリアする */
                MXOTN2 = 0;/* 出力をクリアする */
                
                TSB_PG->DATA = MXOTN0;/* 出力更新 */
                
                REG_00 = TSB_PN->DATA;/* データレジスタをロード */
                REG_00 &= 0x01;/* 0ビット目のみ残す */
                MXOTN1 |= REG_00;/* ORする */
                TSB_PN->DATA = MXOTN1;/* 出力更新 */
                
                REG_00 = TSB_PC->DATA;/* データレジスタをロード */
                REG_00 &= 0x07;/* 0～2ビット目のみ残す */
                MXOTN2 |= REG_00;/* ORする */
                TSB_PC->DATA = MXOTN2;/* 出力更新 */
                
                DSPLN1 = TSTTOP[0];/* データ長をセット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                
                DSPLN2 = TSTMS0[0];/* データ長をセット */
                MHEAD2 = TSTMS0;/* 先頭アドレスセット */
                
                TSB_PC_DATA_PC2 = 1;/* ブザー出力をオンする */
                
                STSTM1++;/* タイマインクリメント */
                
                if (STSTM1 >= 10) {
                    /* 0.5秒経過した場合 */
                    TSB_PC_DATA_PC2 = 0;/* ブザー出力をオフする */
                    TNO = 2;/* LCD（VFD）確認の項目番号をセット */
                    SUBTNO = 0;/* サブテストナンバーをクリア */
                    
