ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                }
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 2) {
                /* LCD（VFD）の確認である場合 */
                REG_00 = SUBTNO;/* サブテスト番号をセット */
                REG_00 &= 0x0F;/* 必要な分だけマスク */
                DSPLB1[0] = NUMDEG[REG_00];/* 数値化…shift-jisセット */
                memcpy(DSPLB1 + 1, DSPLB1, 15);/* メモリーコピーで全部数字にする */
                
                STSTM1++;/* タイマをインクリメント */
                if (STSTM1 >= 10) {
                    /* 0.5秒経過した場合 */
                    STSTM1 = 0;/* タイマクリア */
                    SUBTNO++;/* インクリメント */
                    if ((SUBTNO & 0x0F) >= 10) {
                        /* 10以上になる場合 */
                        SUBTNO &= 0xF0;/* 下をクリア */
                        SUBTNO += 0x10;/* 加算する */
                        
                        if (SUBTNO >= 0x20) {
                            /* 2回終了時であった場合 */
                            SUBTNO = 0;/* サブ番号をクリア */
                            TNO = 3;/* 次の確認へ */
                            
                        }
                        
                    }
                    
                }
                
                DSPLN1 = DSPLN2 = 16;/* データ長をセットする */
                MHEAD1 = DSPLB1;/* 先頭アドレスセット */
                MHEAD2 = DSPLB1;/* 先頭アドレスセット（上と同じ） */
                MHEAD1 --;/* アドレスデクリメント */
                MHEAD2 --;/* アドレスデクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 3) {
                /* LEDの確認である場合 */
                if (SUBTNO > 0) {
                    /* 最初のシーケンスではない場合 */
                    TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                    
                } else {
                    /* 最初のシーケンスである場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN6 |= 0x80;/* チラー予約LEDをオン */
                    SUBTNO = 1;/* サブ番号を次へ */
                    
                }
                
                STSTM1++;/* タイマインクリメント */
                if (STSTM1 >= 10) {
                    /* 0.5秒経過した場合 */
                    MXOTN6 >>= 1;/* 1bitシフト */
                    
                    if (MXOTN6 == 0) {
                        /* LED出力終わりの場合 */
                        SUBTNO = 0;/* サブ番号をクリア */
                        TNO = 4;/* 次の確認項目へ */
                        
                    }
                    
                }
                
                DSPLN1 = TSTTOP[0];/* データ長をセット */
                MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                
                DSPLN2 = TSTMS1[0];/* データ長をセット */
                MHEAD2 = TSTMS1;/* 先頭アドレスをセット */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 4) {
                /* スイッチの確認である場合 */
                if (SUBTNO > 0) {
                    /* 最初のシーケンスではない場合 */
                    TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                    
                } else {
                    /* 最初のシーケンスである場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    BITPOS = 0x01;/* スイッチ入力のベリファイ用 */
                    SUBTNO = 1;/* サブ番号を次へ */
                    
                }
                
                if (MXSWO0 == BITPOS) {
                    /* スイッチ入力とベリファイ用の値が同じである場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    SUBTNO++;/* インクリメント */
                    BITPOS <<= 1;/* 1ﾋﾞｯﾄシフト */
                    
                    if (BITPOS == 0) {
                        /* シフト後の値がゼロの場合 */
                        SUBTNO = 0;/* クリア */
                        TNO = 5;/* 次の確認へ */
                        
                    }
                    
                }
                
                memcpy(DSPLB2, TSTMS2 + 1, 16);/* メモリーコピー */
                DSPLB2[2] = NUMDEG[SUBTNO];/* 数字を文字列化してイン */
                DSPLN2 = 16;/* データ長セット */
                
                DSPLN1 = TSTTOP[0];/* データ長をセット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                MHEAD2 --;/* デクリメント */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 5) {
                /* 出力の確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 最初のシーケンスであった場合 */
                    SUBTNO = 1;/* 1をセット */
                    MXOTN0 = 0x01;/* 常温真空弁出力をセットする */
                    
                }
                
                STSTM1++;/* タイマをインクリメント */
                if (STSTM1 >= 10) {
                    /* 0.5秒経過した場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    STSTM1 = 0;/* タイマクリア */
                    if (MXOTN0 > 0) {
                        /* 何かビットが立っている場合 */
                        MXOTN0 <<= 1;/* 1ﾋﾞｯﾄ左シフト */
                        if (MXOTN0 == 0) {
                            /* ゼロになる場合 */
                            MXOTN1 |= 0x02;/* 冷却槽排水弁出力セット */
                            
                        }
                        
                    } else if ((MXOTN1 & 0xFE) > 0) {
                        /* 何かビットが立っている場合 */
                        MXOTN1 <<= 1;/* 1ﾋﾞｯﾄシフト */
                        
                        if (MXOTN1 == 0) {
                            /* ゼロになる場合 */
                            MXOTN2 |= 0x08;/* チラー循環Pをセット */
                            
                        }
                        
                    } else if ((MXOTN2 & 0xF8) > 0) {
                        /* 何かビットが立っている場合 */
                        MXOTN2 <<= 1;/* 1ビットシフト */
                        
                        if (MXOTN2 == 0) {
                            /* ゼロになる場合 */
                            SUBTNO = 0;/* テストナンバークリア */
                            TNO = 6;/* 次の確認へ */
                            
