ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                        }
                        
                    }
                    
                }/* 0.5秒経過していない場合はここに抜ける */
                
                /* 出力の更新 */
                TSB_PG->DATA = MXOTN0;/* 出力更新 */
                
                REG_00 = TSB_PN->DATA;/* 現在の出力を読み出す */
                REG_00 &= 0x01;/* 0ビット目は残すようにマスク */
                REG_00 |= MXOTN1;/* ORする */
                TSB_PN->DATA = REG_00;/* 出力更新 */
                
                REG_00 = TSB_PC->DATA;/* 現在の出力を読み出す */
                REG_00 &= 0x07;/* 0ビット目は残すようにマスク */
                REG_00 |= MXOTN2;/* ORする */
                TSB_PC->DATA = REG_00;/* 出力更新 */
                
                /* 画面データをセットする */
                DSPLN1 = TSTTOP[0];/* データ長をセット */
                MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                DSPLN2 = TSTMS3[0];/* データ長をセット */
                MHEAD2 = TSTMS3;/* 先頭アドレスをセット */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 6) {
                /* 外部入力の確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 最初のシーケンスであった場合 */
                    SUBTNO = 1;/* 1をセット */
                    BITPOS = 0x01;/* 比較用変数セット */
                    
                }
                
                if (SUBTNO < 9) {
                    /* MXINO0の確認の場合 */
                    if ((MXINO0 == BITPOS) && (MXINO1 == 0)) {
                        /* 一致する場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        
                        SUBTNO++;/* テストナンバーインクリメント */
                        if (SUBTNO == 6) {
                            /* ナンバーが6になる場合 */
                            SUBTNO++;/* 更にインクリメント */
                            BITPOS <<= 1;/* 1ﾋﾞｯﾄ左シフト */
                            
                        }
                        BITPOS <<= 1;/* 1ビット左シフト */
                        
                        if (BITPOS == 0) {
                            /* ゼロになった場合 */
                            BITPOS = 1;/* 再度1セット */
                            
                        }
                        
                    }/* 一致しなければここに抜ける */
                    
                } else {
                    /* MXINO1の確認の場合 */
                    if ((MXINO1 == BITPOS) && (MXINO0 == 0)) {
                        /* 一致する場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        
                        SUBTNO++;/* テストナンバーインクリメント */
                        if (SUBTNO == 10) {
                            /* ナンバーが10になる場合 */
                            SUBTNO += 3;/* +3する */
                            BITPOS = 0x08;/* ディップスイッチ確認位置-1のポジションにする */
                            
                        }
                        BITPOS <<= 1;/* 1ﾋﾞｯﾄ左シフト */
                        
                        if (BITPOS == 0) {
                            /* ゼロになった場合 */
                            SUBTNO = 0;/* サブ番号をクリア */
                            TNO = 7;/* 次の確認へ */
                            
                        }
                        
                    }/* 一致しない場合はここに抜ける */
                    
                }
                
                DSPLN1 = TSTTOP[0];/* データ長セット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                
                if (SUBTNO < 13) {
                    /* ディップスイッチの確認以前である場合 */
                    DSPLN2 = TSTMS4[0];/* データ長をセット */
                    MHEAD2 = TSTMS4;/* 先頭アドレスセット */
                    
                } else {
                    /* ディップスイッチの確認である場合 */
                    DSPLN2 = TSTMSB[0];/* データ長セット */
                    memcpy(DSPLB2, TSTMSB + 1, 16);/* メモリーコピー */
                    DSPLB2[14] = NUMDEG[ 4 - (SUBTNO - 13) ];/* 数字を文字にコンバート */
                    
                    MHEAD2 = DSPLB2;/* 先頭アドレスセット */
                    MHEAD2 --;/* アドレスデクリメント */
                    
                }
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 7) {
                /* A/D595 ALARMの確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if ((MXINO1 == 0x02) && (MXINO0 == 0)) {
                    /* 断線信号が入った場合 */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    SUBTNO = 0;/* クリア */
                    TNO = 8;/* 次の確認へ */
                    
                }
                
                DSPLN1 = TSTTOP[0];/* データ長セット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                
                DSPLN2 = TSTMS5[0];/* データ長セット */
                MHEAD2 = TSTMS5;/* 先頭アドレスセット */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 8) {
                /* 通信ポートの確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 最初の場合 */
                    TBUF0[0] = 0x0F;/* 送信データセット */
                    TBUF0[1] = 0xF0;/* 送信データセット */
                    
                    /* 送信前準備 */
                    TXPTR0 = 0;/* ポインタゼロ */
                    TXLEN0 = TXSET0 = 2;/* 2バイトセット */
                    TXFLG0 |= 0x11;/* 送信中、送信フラグをセット */
                    TXFLG0 &= 0xDF;/* 送信バッファエンプティをクリア */
                    
                    /* データを格納し送信処理 */
                    TSB_SC0->BUF = TBUF0[TXPTR0];/* バッファにセット */
                    
                    TXPTR0++;/* ﾎﾟｲﾝﾀをｲﾝｸﾘﾒﾝﾄ */
                    TXLEN0--;/* ﾃﾞｸﾘﾒﾝﾄ */
                    TXSET0--;/* ﾃﾞｸﾘﾒﾝﾄ */
                    
                    SUBTNO++;/* インクリメント */
                    
                } else if (SUBTNO == 1) {
                    /* 受信待ち */
                    STSTM1++;/* タイマーをインクリメント */
                    if (STSTM1 >= 10) {
                        /* 0.5秒経過した場合 */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO++;/* インクリメント */
                        
