ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                    }
                    
                } else {
                    /* 結果確認 */
                    if (((TXFLG0 & 0x20) > 0) && ((TXFLG0 & 0x11) == 0) && (RXLEN0 == 2)
                    && (RBUF0[(RXPTR0 + 0) & 0x0FF] == 0x0F) && (RBUF0[(RXPTR0 + 1) & 0x0FF] == 0xF0)) {
                        /* 送信バッファエンプティで、送信中送信フラグがオフであり、受信数が2で
                        期待通りの受信データであった場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        SUBTNO = 0;/* クリア */
                        TNO = 9;/* 次の確認処理へ */
                        
                    } else {
                        /* おかしかった場合 */
                        SUBTNO = 0;/* クリア */
                        
                    }
                    
                    RXPTR0 = 0;/* 受信ポインタクリア */
                    RXLEN0 = 0;/* 受信長クリア */
                    
                    TXFLG0 &= 0xEE;/* 送信フラグクリア */
                    TXFLG0 |= 0x20;/* 送信バッファエンプティをセット */
                    TXPTR0 = 0;/* 送信ポインタクリア */
                    TXLEN0 = TXSET0 = 0;/* 送信長、送信セット数クリア */
                    
                }
                
                DSPLN1 = TSTTOP[0];/* データ長セット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                DSPLN2 = TSTMS6[0];/* データ長セット */
                MHEAD2 = TSTMS6;/* 先頭アドレスセット */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 9) {
                /* RTCの確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 1回目確認である場合 */
                    CRTCDT = RTCDT[0];/* 秒をロード */
                    SUBTNO = 1;/* 1をセット */
                    
                } else {
                    /* 2回目の確認である場合 */
                    STSTM1++;/* タイマをインクリメント */
                    if (STSTM1 >= 30) {
                        /* 1.5秒以上経過した場合 */
                        STSTM1 = 0;/* タイマークリア */
                        SUBTNO = 0;/* サブテストナンバークリア */
                        
                        if (RTCDT[0] >= CRTCDT) {
                            /* 現在秒の方が過去秒以上である場合 */
                            REG_00 = (RTCDT[0] - CRTCDT);/* 引きます */
                            
                        } else {
                            /* 逆の場合 */
                            REG_00 = (RTCDT[0] + 60);/* 60秒加算セット */
                            REG_00 -= CRTCDT;/* 過去秒を引く */
                            
                        }
                        
                        if ((REG_00 >= 1) && (REG_00 < 3)) {
                            /* 秒の差が1以上、3未満である場合 */
                            TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                            TNO = 10;/* 次の確認処理へ */
                            
                        }
                        
                    }
                    
                }
                
                DSPLN1 = TSTTOP[0];/* データ長セット */
                MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                DSPLN2 = TSTMS7[0];/* データ長セット */
                MHEAD2 = TSTMS7;/* 先頭アドレスセット */
                
                DLWSQ = 29;/* 1,2行目表示から開始 */
                i = 0;/* 再度ループに入りなおし可 */
                
            } else if (TNO == 10) {
                /* NV-RAMの確認1である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* サブテストナンバーが０の場合 */
                    STSTM1++;/* タイマインクリメント */
                    if (STSTM1 >= 20) {
                        /* 1秒経過した場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO = 1;/* 次の処理へ */
                        
                    }
                    
                    for (uint8_t i = 0;i < 32;i++) {
                        /* 32回繰り返し処理 */
                        *HENNP[i] = 0;/* データをクリアする */
                        
                    }
                    
                    *HENNP[0] = 0x01;/* PASS1 */
                    *HENNP[1] = 0xAA;/* PASS2 */
                    *HENNP[4] = 0x0A;/* パターン1設定温度　10℃ */
                    *HENNP[5] = 0x0A;/* パターン2設定温度　10℃ */
                    *HENNP[6] = 0x0A;/* パターン3設定温度　10℃ */
                    *HENNP[7] = 0x0A;/* パターン4設定温度　10℃ */
                    *HENNP[9] = 20;/* 常温槽設定水温　20℃ */
                    *HENNP[20] = 0;/* チラー予約時間（分）　0分 */
                    *HENNP[21] = 8;/* チラー予約時間（時）　8時 */
                    *HENNP[25] = 5;/* パターン1徐冷温度　5分 */
                    *HENNP[26] = 5;/* パターン2徐冷温度　5℃ */
                    *HENNP[27] = 5;/* パターン3徐冷温度　5分 */
                    *HENNP[28] = 5;/* パターン4徐冷温度　5℃ */
                    *HENNP[29] = 11;/* ☆現在のパターン選択値を"11"にする（テスト用）☆ */
                    
                    DSPLN1 = TSTTOP[0];/* データ長セット */
                    MHEAD1 = TSTTOP;/* 先頭アドレスセット */
                    DSPLN2 = TSTMS8[0];/* データ長セット */
                    MHEAD2 = TSTMS8;/* 先頭アドレスセット */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    
                } else {
                    /* サブテストナンバーが1の場合 */
                    DSPLN2 = TSTMSC[0];/* データ長セット */
                    MHEAD2 = TSTMSC;/* 先頭アドレスセット */
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    
                }
                
            } else if (TNO == 11) {
                /* NV-RAMの確認2である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 最初のシーケンスである場合 */
                    STSTM1++;/* タイマインクリメント */
                    if (STSTM1 >= 10) {
                        /* 0.5秒経過した場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO = 1;/* 次へ */
                        
