ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
                    }
                    
                    DSPLN1 = TSTTOP[0];/* データ長をセット */
                    MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                    DSPLN2 = TSTMS8[0];/* データ長をセット */
                    MHEAD2 = TSTMS8;/* 先頭アドレスをセット */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループ入りなおし可 */
                    
                } else {
                    /* データ読み出しチェック時である場合 */
                    NPAT = 0;/* "0"にする */
                    
                    REG_00 = 0;/* 一旦クリア */
                    for (uint8_t j = 0;j < 31;j++) {
                        /* 31回繰り返し */
                        if (NVRMITB[j] == *HENNP[j]) {
                            /* 値が一致する場合 */
                            /* 何もしない */
                            
                        } else {
                            /* 値が一致しない場合 */
                            REG_00 ++;/* インクリメント */
                            
                        }
                        
                    }/* 繰り返しここまで */
                    
                    if (REG_00 == 0) {
                        /* 何も異常が無かった場合 */
                        STSTM1++;/* タイマインクリメント */
                        if (STSTM1 >= 10) {
                            /* 0.5秒経過した場合 */
                            TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                            STSTM1 = 0;/* タイマクリア */
                            SUBTNO = 0;/* サブシーケンスクリア */
                            TNO = 12;/* 次の確認へ */
                            
                        }
                        
                        
                        DSPLN2 = TSTMS9[0];/* データ長セット */
                        MHEAD2 = TSTMS9;/* 先頭アドレスセット */
                        
                    } else {
                        /* 何か異常があった場合 */
                        DSPLN2 = TSTMSA[0];/* データ長セット */
                        MHEAD2 = TSTMSA;/* 先頭アドレスセット */
                        
                    }
                    
                    DLWSQ = 33;/* 2行目表示から開始 */
                    i = 0;/* 再度ループに入りなおし可 */
                    
                }
                
            } else if (TNO == 12) {
                /* HACCP出力接点の確認である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザー出力をクリアする */
                
                if (SUBTNO == 0) {
                    /* 最初のシーケンスである場合 */
                    STSTM1++;/* タイマインクリメント */
                    if (STSTM1 >= 10) {
                        /* 0.5秒経過した場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO = 1;/* 次へ */
                        
                    }
                    
                    TSB_PE->DATA &= 0xF3;/* 冷却運転・異常出力をオフにする */
                    
                    DSPLN1 = TSTTOP[0];/* データ長をセット */
                    MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                    DSPLN2 = TSTMSD[0];/* データ長をセット */
                    MHEAD2 = TSTMSD;/* 先頭アドレスをセット */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループ入りなおし可 */
                    
                } else if (SUBTNO == 1) {
                    /* 2番目のシーケンスである場合 */
                    STSTM1++;/* タイマインクリメント */
                    if (STSTM1 >= 20) {
                        /* 1秒経過した場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO = 2;/* 次へ */
                        
                    }
                    
                    TSB_PE->DATA |= 0x04;/* 冷却運転出力をオンにする */
                    
                    DSPLN1 = TSTTOP[0];/* データ長をセット */
                    MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                    DSPLN2 = TSTMSD[0];/* データ長をセット */
                    
                    memcpy(DSPLB2, TSTMSD + 1, 16);/* メモリーコピー */
                    DSPLB2[11] = NUMDEG[1];/* 文字データ「１」セット */
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループ入りなおし可 */
                    
                } else if (SUBTNO == 2) {
                    /* 3番目のシーケンスである場合 */
                    STSTM1++;/* タイマインクリメント */
                    if (STSTM1 >= 20) {
                        /* 1秒経過した場合 */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        STSTM1 = 0;/* タイマクリア */
                        SUBTNO = 0;/* 最初へ戻る */
                        
                    }
                    
                    TSB_PE->DATA |= 0x08;/* 異常出力をオンにする */
                    
                    DSPLN1 = TSTTOP[0];/* データ長をセット */
                    MHEAD1 = TSTTOP;/* 先頭アドレスをセット */
                    DSPLN2 = TSTMSD[0];/* データ長をセット */
                    
                    memcpy(DSPLB2, TSTMSD + 1, 16);/* メモリーコピー */
                    DSPLB2[11] = NUMDEG[2];/* 文字データ「２」セット */
                    MHEAD2 = DSPLB2;/* 先頭アドレスをセット */
                    MHEAD2 --;/* アドレスデクリメント */
                    
                    DLWSQ = 29;/* 1,2行目表示から開始 */
                    i = 0;/* 再度ループ入りなおし可 */
                    
                }
                
            }
            
            break;/* 抜けます */
            
        case 25:
            /* 1行目2行目の表示をクリアする処理 */
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 26:
            /* ビジーフラグチェック */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
