ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
            }
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 27:
            /* 画面クリアコマンドの送信 */
            TSB_PA_DATA_PA6 = 0;/* RWオフにする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、クリアコマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA |= 0x01;/* LCDデータバス出力をセット、クリアコマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 28:
            /* ビジーフラグチェック */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            DLWSQ = 31;/* 番号を31にする */
            i = 0;/* クリア */
            continue;/* ループ先頭に戻る */
            /* ブレークは書かない */
            
        case 29:
            /* 1,2行目を表示する処理 */
            /* まずは1行目の表示カーソルを合わせる */
            TSB_PA_DATA_PA6 = 0;/* RWオフにする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x08;/* LCDデータバス出力をセット、1行目コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、1行目コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 30:
            /* ビジーフラグの確認 */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 31:
            /* 1行目に文字を表示する処理 */
            TSB_PA_DATA_PA6 = 0;/* R/Wをオフ */
            TSB_PA_DATA_PA7 = 1;/* RSをオン */
            
            MHEAD1++;/* アドレスインクリメント */
            
            REG_00 = *MHEAD1;/* 実体の数字をセット */
            REG_01 = REG_00;/* もうひとつにもコピー */
            REG_00 >>= 4;/* 4ビット右シフト */
            REG_00 &= 0x0F;/* 必要な分だけマスク */
            REG_01 &= 0x0F;/* 必要な分だけマスク */
            
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= REG_00;/* LCDデータバス出力をセット、データ上位 */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= REG_01;/* LCDデータバス出力をセット、データ下位 */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            TSB_PA_DATA_PA7 = 0;/* RSをオフする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 32:
            /* ビジーフラグの確認とまだ文字表示残があるか確認 */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            if (DSPLN1 > 0) {
                /* 1以上の場合 */
                DSPLN1--;/* デクリメント */
                
            }
            
            if (DSPLN1 == 0) {
                /* 送信するものが0である場合 */
                DLWSQ++;/* 番号インクリメント */
                
            } else {
                /* 送信するものがまだある場合 */
                DLWSQ = 31;/* 再度31にセット */
                i = 0;/* 繰り返しできる様に値をクリア */
                continue;/* ループの先頭へ */
                
            }
            /* ブレークは書かない */
            
        case 33:
            /* 2行目を表示する処理 */
            /* 2行目の表示カーソルを合わせる */
            TSB_PA_DATA_PA6 = 0;/* RWオフにする */
            TSB_PA_DATA_PA7 = 0;/* RSオフにする */
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x0C;/* LCDデータバス出力をセット、2行目コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= 0x00;/* LCDデータバス出力をセット、2行目コマンド */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 34:
            /* ビジーフラグの確認 */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 35:
            /* 2行目に文字を表示する処理 */
            TSB_PA_DATA_PA6 = 0;/* R/Wをオフ */
            TSB_PA_DATA_PA7 = 1;/* RSをオン */
            
