ASAO-KYOICHI/SVC_RCL_PG/tmpm380_DCONT.c
            MHEAD2++;/* アドレスインクリメント */
            
            REG_00 = *MHEAD2;/* 実体の数字をセット */
            REG_01 = REG_00;/* もうひとつにもコピー */
            REG_00 >>= 4;/* 4ビット右シフト */
            REG_00 &= 0x0F;/* 必要な分だけマスク */
            REG_01 &= 0x0F;/* 必要な分だけマスク */
            
            TSB_PF->IE &= 0xF0;/* LCDデータバスを非入力にする */
            TSB_PF->CR |= 0x0F;/* LCDデータバスを出力にする */
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= REG_00;/* LCDデータバス出力をセット、データ上位 */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->DATA &= 0xF0;/* 一旦マスク */
            TSB_PF->DATA |= REG_01;/* LCDデータバス出力をセット、データ下位 */
            
            EPLS();/* Eをパルス出力する */
            
            TSB_PF->CR &= 0xF0;/* 出力機能をオフ */
            TSB_PF->IE |= 0x0F;/* 入力機能をオン */
            TSB_PA_DATA_PA6 = 1;/* RWをオンする */
            TSB_PA_DATA_PA7 = 0;/* RSをオフする */
            
            DLWSQ++;/* 番号インクリメント */
            /* ブレークは書かない */
            
        case 36:
            /* ビジーフラグの確認とまだ文字表示残があるか確認 */
            if ((EPBSY() & 0x08) > 0) {
                /* ビジーフラグがオンである場合 */
                OS_LoadTime->NEXT_LOAD_Time[5] = 0;/* 次回呼び出し時間 */
                OS_LoadTime->TSK_COND[5] = 0x80;/* 遅延フラグ建築 */
                
                return;/* 戻る */
                
            }
            
            if (DSPLN2 > 0) {
                /* 1以上の場合 */
                DSPLN2--;/* デクリメント */
                
            }
            
            if (DSPLN2 == 0) {
                /* 送信するものが0である場合 */
                DLWSQ = 10;/* 次回の開始位置をセットする */
                i = 1;/* 明示的に繰り返しを終わらせる */
                
            } else {
                /* 送信するものがまだある場合 */
                DLWSQ = 35;/* 再度35にセット */
                i = 0;/* 繰り返しできる様に値をクリア */
                continue;/* ループの先頭へ */
                
            }
            
            break;/* 抜けます */
            
        default:
            /* 当てはまらない場合はここに抜ける */
            DLWSQ = 0;/* リセットするぜ */
            break;/* 抜ける */
            
        }/* スイッチ文はここまで */
        
    }/* ループはここまで */
    
    OS_LoadTime->NEXT_LOAD_Time[5] = 50;/* 次回呼び出し時間 */
    OS_LoadTime->TSK_COND[5] = 0xA0;/* 遅延フラグ建築 */
    
    return;/* 戻る */
    
}

/***
 * 題名：Eパルス出力ルーチン
 * 作成者：浅尾　享一
 * LCD/VFD表示時に必要なEパルス処理
***/
void EPLS(void)
{
    TSB_PA_DATA_PA5 = 1;/* E信号をHIGHにする */
    for (uint8_t i = 0;i < 5;i++) {
        __NOP();/* タイミングずらし */
        
    }
    TSB_PA_DATA_PA5 = 0;/* E信号をLOWにする */
    
    return;/* 戻る */
    
}

/***
 * 題名：Pビジーフラグのチェックルーチン
 * 作成者：浅尾　享一
 * LCD/VFD処理時に必要なPビジーフラグチェックルーチン
***/
uint8_t EPBSY(void)
{
    uint8_t REG_00 = 0;/* 一時変数をセット */
    
    TSB_PA_DATA_PA5 = 1;/* E信号をHIGHにする */
    for (uint8_t i = 0;i < 5;i++) {
        __NOP();/* タイミングずらし */
        
    }
    REG_00 = TSB_PF->DATA;/* PFポートのデータをロード */
    REG_00 &= 0x0F;/* 4bitにマスク */
    TSB_PA_DATA_PA5 = 0;/* E信号をLOWにする */
    
    for (uint8_t i = 0;i < 5;i++) {
        __NOP();/* タイミングずらし */
        
    }
    TSB_PA_DATA_PA5 = 1;/* E信号をHIGHにする */
    for (uint8_t i = 0;i < 5;i++) {
        __NOP();/* タイミングずらし */
        
    }
    TSB_PA_DATA_PA5 = 0;/* E信号をLOWにする */
    
    return REG_00;/* 値をセットして戻る */
    
}

/***
 * 題名：メモリークリア受付時の表示
 * 作成者：浅尾　享一
 * メモリークリア受付中表示を出す
***/
void MCLRMS(void)
{
    TSB_PF_DATA_PF4 = 1;/* バックライト出力をオンする */
    DSPLN1 = MCLMS0[0];/* 1行目のデータ長をセットする */
    MHEAD1 = &(MCLMS0[0]);/* メッセージの先頭アドレスをセットする */
    
    DSPLN2 = MCLMS1[0];/* 1行目のデータ長をセットする */
    MHEAD2 = &(MCLMS1[0]);/* メッセージの先頭アドレスをセットする */
    
    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
    
    STSTM1++;/* タイマインクリメント */
    if (STSTM1 >= 10) {
        /* 0.5秒経過した場合 */
        STSTM1 = 0;/* タイマクリア */
        TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
        STSFL1 &= 0xFD;/* メモリークリア受付中をクリア */
        
        MCLAST = 0;/* メモリークリア受付タイマをクリアする */
        
    }
    
    return;/* 戻る */
    
}